ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_rtdma_regs.xml
<module id="HSM_RTDMA" HW_revision="" description="HSM RTDMA Registers">
	<register id="DMACTRL" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="HARDRESET" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRIORITYRESET" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="15" end="2" width="14" rwaccess="R"/>
		<bitfield id="PRIORITYSEL" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_2" description="" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="DEBUGCTRL" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="RESERVED_1" description="" begin="14" end="0" width="15" rwaccess="R"/>
		<bitfield id="FREE" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_2" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REVISION" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="TYPE" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="REV" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="RESERVED_1" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RESERVED_2" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SWPRI1" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="CH1PRIORITY" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH2PRIORITY" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CH3PRIORITY" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CH4PRIORITY" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CH5PRIORITY" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="CH6PRIORITY" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="CH7PRIORITY" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="CH8PRIORITY" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="SWPRI2" width="32" page="0" offset="24" internal="0" description="">
	</register>
	<register id="PRIORITYSTAT" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="ACTIVESTS" description="" begin="4" end="0" width="5" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="7" end="5" width="3" rwaccess="R"/>
		<bitfield id="ACTIVESTS_SHADOW" description="" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="RESERVED_2" description="" begin="31" end="13" width="19" rwaccess="R"/>
	</register>
	<register id="RESERVED_3" width="32" page="0" offset="32" instances="8" instaddr="4" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="DMACFG_LOCK" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="LOCK" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="DMACFG_COMMIT" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="COMMIT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
</module>
